#+title: Venkatesh Choppella Emacs configuration
#+AUTHOR:    Venkatesh Choppella
#+EMAIL:     venkatesh.choppella@iiit.ac.in
#+DATE:      [2015-09-07 Mon]
#+DESCRIPTION:
#+KEYWORDS:
#+LANGUAGE:  en
#+OPTIONS:   H:3 num:t toc:t \n:nil @:t ::t |:t ^:nil -:t f:t *:t <:nil
#+OPTIONS:   TeX:t LaTeX:t skip:nil d:nil todo:t pri:nil tags:not-in-toc
#+INFOJS_OPT: view:nil toc:nil ltoc:t mouse:underline buttons:0 path:http://orgmode.org/org-info.js
#+EXPORT_SELECT_TAGS: export
#+EXPORT_EXCLUDE_TAGS: noexport
#+LINK_UP:   
#+LINK_HOME: 
#+XSLT:
#+PROPERTY: session *scratch*
#+PROPERTY: results output
#+PROPERTY: tangle init.el
#+PROPERTY: eval no
#+PROPERTY: exports code

* Emacs version and set up of emacs directories
I am using emacs version
#+BEGIN_SRC emacs-lisp :eval t :results value :exports both :tangle no
(version)
#+END_SRC

#+RESULTS:
: GNU Emacs 25.2.2 (x86_64-pc-linux-gnu, GTK+ Version 3.10.8)
:  of 2017-05-06

** Current value of =load-path=
The current value of load path is given below

#+BEGIN_SRC emacs-lisp :eval t :results value :exports both
;;; pretty print the load-path, one directory per line
(defun pprint-load-path ()
   (mapconcat 'identity load-path  "\n"))
(pprint-load-path)
#+END_SRC
#+RESULTS:
#+begin_example
/home/choppell/venk/work/new/prj/emacs/src/org/other/org-8.3.4/contrib
/home/choppell/venk/work/new/prj/emacs/src/org/other/org-8.3.4/lisp
/home/choppell/venk/work/new/prj/emacs/src/org/git/org-ref
/home/choppell/venk/work/new/prj/emacs/src/org/custom/shell
/home/choppell/venk/work/new/prj/emacs/src/org/custom/racket
/home/choppell/venk/work/new/prj/emacs/src/org/custom/org-mode/contrib/ox-bibtex
/home/choppell/venk/work/new/prj/emacs/src/org/custom/org-mode
/home/choppell/venk/work/new/prj/emacs/src/org/custom/misc
/home/choppell/venk/work/new/prj/emacs/src/org/custom/faces
/home/choppell/venk/work/new/prj/emacs/src/org/custom/dired
/home/choppell/venk/work/new/prj/emacs/src/org/custom
/home/choppell/emacs/git/org-ref/citeproc/csl
/home/choppell/emacs/git/org-ref/citeproc
~/emacs/custom/org-tree-slide
~/emacs/custom/shell
~/emacs/custom/org-mode/contrib/journal
~/emacs/custom/org-mode
~/emacs/custom/racket
~/emacs/custom/misc
~/emacs/custom/keys
~/emacs/custom/js
~/emacs/custom/faces
~/emacs/custom/dired
~/emacs/packages/other/alloy-mode
~/emacs/packages/other/pathname
~/emacs/git/org-ref
/home/choppell/.emacs.d/elpa/bbdb-20151114.1541
/home/choppell/.emacs.d/elpa/calfw-gcal-20120111.200
/home/choppell/.emacs.d/elpa/edit-server-htmlize-20130329.1548
/home/choppell/.emacs.d/elpa/edit-server-20141231.1358
/home/choppell/.emacs.d/elpa/ham-mode-20150811.606
/home/choppell/.emacs.d/elpa/helm-bibtex-20170808.1124
/home/choppell/.emacs.d/elpa/biblio-20161014.1604
/home/choppell/.emacs.d/elpa/biblio-core-20160901.1115
/home/choppell/.emacs.d/elpa/helm-20170827.134
/home/choppell/.emacs.d/elpa/helm-core-20170821.2134
/home/choppell/.emacs.d/elpa/async-20170823.2116
/home/choppell/.emacs.d/elpa/html-to-markdown-20151105.40
/home/choppell/.emacs.d/elpa/hydra-20170813.1058
/home/choppell/.emacs.d/elpa/ivy-20170817.1000
/home/choppell/.emacs.d/elpa/js-comint-20161212.2125
/home/choppell/.emacs.d/elpa/js2-mode-20170116.733
/home/choppell/.emacs.d/elpa/js3-mode-20160515.850
/home/choppell/.emacs.d/elpa/key-chord-20160227.438
/home/choppell/.emacs.d/elpa/magit-20150124.930
/home/choppell/.emacs.d/elpa/git-rebase-mode-20150122.1114
/home/choppell/.emacs.d/elpa/git-commit-mode-20141014.1634
/home/choppell/.emacs.d/elpa/markdown-mode-20161222.1416
/home/choppell/.emacs.d/elpa/nodejs-repl-20170110.940
/home/choppell/.emacs.d/elpa/nvm-20151113.55
/home/choppell/.emacs.d/elpa/dash-functional-20160615.1351
/home/choppell/.emacs.d/elpa/f-20151113.123
/home/choppell/.emacs.d/elpa/dash-20160223.1028
/home/choppell/.emacs.d/elpa/openwith-20120531.1436
/home/choppell/.emacs.d/elpa/org-gcal-20170420.1401
/home/choppell/.emacs.d/elpa/alert-20170824.1140
/home/choppell/.emacs.d/elpa/log4e-20170401.604
/home/choppell/.emacs.d/elpa/gntp-20141024.1950
/home/choppell/.emacs.d/elpa/org-journal-20151228.603
/home/choppell/.emacs.d/elpa/ox-reveal-20160224.1819
/home/choppell/.emacs.d/elpa/org-20160222
/home/choppell/.emacs.d/elpa/parsebib-20170501.347
/home/choppell/.emacs.d/elpa/pdf-tools-20170820.1117
/home/choppell/.emacs.d/elpa/popup-20160709.729
/home/choppell/.emacs.d/elpa/racket-mode-20150807.1730
/home/choppell/.emacs.d/elpa/faceup-20150215.1348
/home/choppell/.emacs.d/elpa/request-deferred-20160419.1605
/home/choppell/.emacs.d/elpa/request-20170131.1747
/home/choppell/.emacs.d/elpa/deferred-20170531.2135
/home/choppell/.emacs.d/elpa/s-20140910.334
/home/choppell/.emacs.d/elpa/smex-20151212.1409
/home/choppell/.emacs.d/elpa/tablist-20170219.1935
/home/choppell/.emacs.d/elpa/tern-20161222.850
/home/choppell/.emacs.d/elpa/web-mode-20150722.12
/usr/share/emacs/25.2/site-lisp
/usr/share/emacs/site-lisp
/usr/share/emacs/site-lisp/apel
/usr/share/emacs/site-lisp/autoconf
/usr/share/emacs/site-lisp/coq
/usr/share/emacs/site-lisp/dictionaries-common
/usr/share/emacs/site-lisp/doxymacs
/usr/share/emacs/site-lisp/elscreen
/usr/share/emacs/site-lisp/emacs-mozc
/usr/share/emacs/site-lisp/haskell-mode
/usr/share/emacs/site-lisp/latex-cjk-common
/usr/share/emacs/site-lisp/latex-cjk-thai
/usr/share/emacs/site-lisp/magit
/usr/share/emacs/site-lisp/x-face-el
/usr/share/emacs/site-lisp/apel/attic
/usr/share/emacs/25.2/lisp
/usr/share/emacs/25.2/lisp/vc
/usr/share/emacs/25.2/lisp/url
/usr/share/emacs/25.2/lisp/textmodes
/usr/share/emacs/25.2/lisp/progmodes
/usr/share/emacs/25.2/lisp/play
/usr/share/emacs/25.2/lisp/org
/usr/share/emacs/25.2/lisp/nxml
/usr/share/emacs/25.2/lisp/net
/usr/share/emacs/25.2/lisp/mh-e
/usr/share/emacs/25.2/lisp/mail
/usr/share/emacs/25.2/lisp/leim
/usr/share/emacs/25.2/lisp/language
/usr/share/emacs/25.2/lisp/international
/usr/share/emacs/25.2/lisp/gnus
/usr/share/emacs/25.2/lisp/eshell
/usr/share/emacs/25.2/lisp/erc
/usr/share/emacs/25.2/lisp/emulation
/usr/share/emacs/25.2/lisp/emacs-lisp
/usr/share/emacs/25.2/lisp/cedet
/usr/share/emacs/25.2/lisp/calendar
/usr/share/emacs/25.2/lisp/calc
/usr/share/emacs/25.2/lisp/obsolete
#+end_example

